Revit 2026 API

# DirectShapeTypeAddReferenceCurve(Curve) Method

---

Adds a reference curve to the DirectShapeType.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void AddReferenceCurve(
	Curve refCurve
)
```
```vb
Public Sub AddReferenceCurve (
	refCurve As Curve
)
```
```cpp
public:
void AddReferenceCurve(
	Curve^ refCurve
)
```
```fsharp
member AddReferenceCurve :
        refCurve : Curve -> unit
```

#### Parameters

refCurve Curve
     The geometry of the new reference curve.

| Exception | Condition |
| --- | --- |
| ArgumentException | refCurve cannot be used for creating a reference curve. |
| ArgumentNullException | A non-optional argument was null |

There are two cases to consider:

  1. The input curve's bounds are set. The resulting reference curve that is added to the DirectShapeType will be displayed with those bounds. Note that the specified bounds must not be degenerate. Permitted curve types are those for which [!:Autodesk::Revit::DB::DirectShapeType::isValidReferenceCurve] returns true.
  2. The input curve is unbounded. Reasonable bounds are automatically calculated and applied to the input curve. The automatic bounds are based on the host DirectShapeType's geometry.

Note that only lines and splines may be unbounded. You must specify valid bounds for all other curve types.

#### Reference

DirectShapeType Class

AddReferenceCurve Overload

Autodesk.Revit.DB Namespace